# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.

# Пример:

# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21
from math import sqrt

ax = float(input("Введите координату X точки А = "))
ay = float(input("Введите координату Y точки А = "))
bx = float(input("Введите координату X точки B = "))
by = float(input("Введите координату Y точки B = "))

print("Расстояние между точками А(", ax, ";", ay, ") и B(",
      bx, ";", by, ") = ", sqrt((bx-ax)**2 + (by-ay)**2))
